emacs/.emacs.d/config.org
#+STARTUP: overview

* Definition of variables etc.

#+begin_src emacs-lisp  :results silent
  (defvar skeleten/font nil
    "Font to use in buffers")
  (defvar skeleten/theme nil
    "Theme to load or 'none to skip")
  (defvar skeleten/org-files-base-dir ""
    "Base directory of org files")

  (defvar skeleten/java/backend nil
    "Completion backend for java. One of: `eclipse', `intellij'")
#+end_src

* General settings
#+begin_src emacs-lisp  :results silent
  (setq skeleten/font "Fira Code 12"
	skeleten/setup-fira-code-ligatures t)
  (setq skeleten/theme 'gruvbox-dark-hard)	; Possible  values currently are:
						  ;  'doom - for the Doom
						  ;  'moe-dark or 'moe-light for the moe
						  ; themes
						  ;  'none - for no theme
						  ;  everything else will be interpretet as
						  ; a theme name and trying to get loaded
						  ; via `load-theme'
  (setq skeleten/org-files-base-dir "~/org")

  ;; add our custom themes to to be loaded
  (add-to-list 'custom-theme-load-path
	       "~/.emacs.d/themes")
  (add-to-list 'load-path
	       "~/.emacs.d/modes")
#+end_src

* Functions
** Better moving at to the beginning of a line
   [[http://emacsredux.com/blog/2013/05/22/smarter-navigation-to-the-beginning-of-a-line/][Credit]]

#+begin_src emacs-lisp  :results silent
(defun smarter-move-beginning-of-line (arg)
  "Move point back to indentation of beginning of line.

Move point to the first non-whitespace character on this line.
If point is already there, move to the beginning of the line.
Effectively toggle between the first non-whitespace character and
the beginning of the line.

If ARG is not nil or 1, move forward ARG - 1 lines first.  If
point reaches the beginning or end of the buffer, stop there."
  (interactive "^p")
  (setq arg (or arg 1))

  ;; Move lines first
  (when (/= arg 1)
    (let ((line-move-visual nil))
      (forward-line (1- arg))))

  (let ((orig-point (point)))
    (back-to-indentation)
    (when (= orig-point (point))
      (move-beginning-of-line 1))))
#+end_src

* Appearance
** Remove clutter
#+begin_src emacs-lisp  :results silent
  (tool-bar-mode -1)
  (menu-bar-mode -1)
  (scroll-bar-mode -1)

#+end_src
** Visuals
#+begin_src emacs-lisp  :results silent
  (defun skeleten/load-theme ()
    "Load and set up the theme"
    (interactive)
    (if (boundp 'skeleten/theme)
	(pcase skeleten/theme
	  ('doom (progn
		   (require 'doom-themes)
		   (setq doom-themes-enable-bold t
			 doom-themes-enable-italic t)
		   (load-theme 'doom-one t)
		   (doom-themes-visual-bell-config)
		   (doom-themes-neotree-config)))
	  ('doom-safe (progn
			(require 'doom-themes)
			(setq doom-themes-enable-bold t
			      doom-themes-enable-italic t)
			(load-theme 'doom-molokai t)
			(doom-themes-visual-bell-config)))
	  ('moe-dark (progn
		       (require 'moe-theme)
		       (setq custom-safe-themes 't)
		       (load-theme 'moe-dark)))
	  ('moe-light (progn
		       (require 'moe-theme)
		       (setq custom-safe-themes 't)
		       (load-theme 'moe-dark)))
	  ('none nil)
	  (other (progn
		   (setq custom-safe-themes 't)
		   (load-theme other))))
      (error "skeleten/theme unbound")))
  (defun skeleten/load-font ()
    "Load and set up the font"
    (interactive)
    (set-face-attribute 'default nil :font skeleten/font)
    (set-frame-font skeleten/font nil t)
    (set-default-font skeleten/font)
    (add-to-list 'default-frame-alist
	       `(font . ,skeleten/font)))
  ;; run it
  (if (daemonp)
      (add-hook 'after-make-frame-functions
		(lambda (frm)
		  (with-selected-frame frm
		    (skeleten/load-theme)
		    (skeleten/load-font))))
    (skeleten/load-theme)
    (skeleten/load-font))
#+end_src
** Window Number
#+begin_src emacs-lisp  :results silent
(require 'window-number)
(window-number-mode)
(window-number-meta-mode)
#+end_src
