emacs/.emacs.d/config.org
** Fira code Ligatures
#+BEGIN_SRC emacs-lisp :results silent
  ;;; Fira code
  ;; This works when using emacs --daemon + emacsclient
  (add-hook 'after-make-frame-functions (lambda (frame) (set-fontset-font t '(#Xe100 . #Xe16f) "Fira Code Symbol")))
  ;; This works when using emacs without server/client
  (set-fontset-font t '(#Xe100 . #Xe16f) "Fira Code Symbol")
  ;; I haven't found one statement that makes both of the above situations work, so I use both for now

  (defconst fira-code-font-lock-keywords-alist
    (mapcar (lambda (regex-char-pair)
	      `(,(car regex-char-pair)
		(0 (prog1 ()
		     (compose-region (match-beginning 1)
				     (match-end 1)
				     ;; The first argument to concat is a string containing a literal tab
				     ,(concat "	" (list (decode-char 'ucs (cadr regex-char-pair)))))))))
	    '(("\\(www\\)"                   #Xe100)
	      ("[^/]\\(\\*\\*\\)[^/]"        #Xe101)
	      ("\\(\\*\\*\\*\\)"             #Xe102)
	      ("\\(\\*\\*/\\)"               #Xe103)
	      ("\\(\\*>\\)"                  #Xe104)
	      ("[^*]\\(\\*/\\)"              #Xe105)
	      ("\\(\\\\\\\\\\)"              #Xe106)
	      ("\\(\\\\\\\\\\\\\\)"          #Xe107)
	      ("\\({-\\)"                    #Xe108)
	      ("\\(\\[\\]\\)"                #Xe109)
	      ("\\(::\\)"                    #Xe10a)
	      ("\\(:::\\)"                   #Xe10b)
	      ("[^=]\\(:=\\)"                #Xe10c)
	      ("\\(!!\\)"                    #Xe10d)
	      ("\\(!=\\)"                    #Xe10e)
	      ("\\(!==\\)"                   #Xe10f)
	      ("\\(-}\\)"                    #Xe110)
	      ("\\(--\\)"                    #Xe111)
	      ("\\(---\\)"                   #Xe112)
	      ("\\(-->\\)"                   #Xe113)
	      ("[^-]\\(->\\)"                #Xe114)
	      ("\\(->>\\)"                   #Xe115)
	      ("\\(-<\\)"                    #Xe116)
	      ("\\(-<<\\)"                   #Xe117)
	      ("\\(-~\\)"                    #Xe118)
	      ("\\(#{\\)"                    #Xe119)
	      ("\\(#\\[\\)"                  #Xe11a)
	      ("\\(##\\)"                    #Xe11b)
	      ("\\(###\\)"                   #Xe11c)
	      ("\\(####\\)"                  #Xe11d)
	      ("\\(#(\\)"                    #Xe11e)
	      ("\\(#\\?\\)"                  #Xe11f)
	      ("\\(#_\\)"                    #Xe120)
	      ("\\(#_(\\)"                   #Xe121)
	      ("\\(\\.-\\)"                  #Xe122)
	      ("\\(\\.=\\)"                  #Xe123)
	      ("\\(\\.\\.\\)"                #Xe124)
	      ("\\(\\.\\.<\\)"               #Xe125)
	      ("\\(\\.\\.\\.\\)"             #Xe126)
	      ("\\(\\?=\\)"                  #Xe127)
	      ("\\(\\?\\?\\)"                #Xe128)
	      ("\\(;;\\)"                    #Xe129)
	      ("\\(/\\*\\)"                  #Xe12a)
	      ("\\(/\\*\\*\\)"               #Xe12b)
	      ("\\(/=\\)"                    #Xe12c)
	      ("\\(/==\\)"                   #Xe12d)
	      ("\\(/>\\)"                    #Xe12e)
	      ("\\(//\\)"                    #Xe12f)
	      ("\\(///\\)"                   #Xe130)
	      ("\\(&&\\)"                    #Xe131)
	      ("\\(||\\)"                    #Xe132)
	      ("\\(||=\\)"                   #Xe133)
	      ("[^|]\\(|=\\)"                #Xe134)
	      ("\\(|>\\)"                    #Xe135)
	      ("\\(\\^=\\)"                  #Xe136)
	      ("\\(\\$>\\)"                  #Xe137)
	      ("\\(\\+\\+\\)"                #Xe138)
	      ("\\(\\+\\+\\+\\)"             #Xe139)
	      ("\\(\\+>\\)"                  #Xe13a)
	      ("\\(=:=\\)"                   #Xe13b)
	      ("[^!/]\\(==\\)[^>]"           #Xe13c)
	      ("\\(===\\)"                   #Xe13d)
	      ("\\(==>\\)"                   #Xe13e)
	      ("[^=n]\\(=>\\)"                #Xe13f)
	      ("\\(=>>\\)"                   #Xe140)
	      ("\\(<=\\)"                    #Xe141)
	      ("\\(=<<\\)"                   #Xe142)
	      ("\\(=/=\\)"                   #Xe143)
	      ("\\(>-\\)"                    #Xe144)
	      ("\\(>=\\)"                    #Xe145)
	      ("\\(>=>\\)"                   #Xe146)
	      ("[^-=]\\(>>\\)"               #Xe147)
	      ("\\(>>-\\)"                   #Xe148)
	      ("\\(>>=\\)"                   #Xe149)
	      ("\\(>>>\\)"                   #Xe14a)
	      ("\\(<\\*\\)"                  #Xe14b)
	      ("\\(<\\*>\\)"                 #Xe14c)
	      ("\\(<|\\)"                    #Xe14d)
	      ("\\(<|>\\)"                   #Xe14e)
	      ("\\(<\\$\\)"                  #Xe14f)
	      ("\\(<\\$>\\)"                 #Xe150)
	      ("\\(<!--\\)"                  #Xe151)
	      ("\\(<-\\)"                    #Xe152)
	      ("\\(<--\\)"                   #Xe153)
	      ("\\(<->\\)"                   #Xe154)
	      ("\\(<\\+\\)"                  #Xe155)
	      ("\\(<\\+>\\)"                 #Xe156)
	      ("\\(<=\\)"                    #Xe157)
	      ("\\(<==\\)"                   #Xe158)
	      ("\\(<=>\\)"                   #Xe159)
	      ("\\(<=<\\)"                   #Xe15a)
	      ("\\(<>\\)"                    #Xe15b)
	      ("[^-=]\\(<<\\)"               #Xe15c)
	      ("\\(<<-\\)"                   #Xe15d)
	      ("\\(<<=\\)"                   #Xe15e)
	      ("\\(<<<\\)"                   #Xe15f)
	      ("\\(<~\\)"                    #Xe160)
	      ("\\(<~~\\)"                   #Xe161)
	      ("\\(</\\)"                    #Xe162)
	      ("\\(</>\\)"                   #Xe163)
	      ("\\(~@\\)"                    #Xe164)
	      ("\\(~-\\)"                    #Xe165)
	      ("\\(~=\\)"                    #Xe166)
	      ("\\(~>\\)"                    #Xe167)
	      ("[^<]\\(~~\\)"                #Xe168)
	      ("\\(~~>\\)"                   #Xe169)
	      ("\\(%%\\)"                    #Xe16a)
	     ;; ("\\(x\\)"                   #Xe16b) This ended up being hard to do properly so i'm leaving it out.
	      ("[^:=]\\(:\\)[^:=]"           #Xe16c)
	      ("[^\\+<>]\\(\\+\\)[^\\+<>]"   #Xe16d)
	      ("[^\\*/<>]\\(\\*\\)[^\\*/<>]" #Xe16f))))

  (defun add-fira-code-symbol-keywords ()
    (when window-system
      (font-lock-add-keywords nil fira-code-font-lock-keywords-alist)))

  (add-hook 'prog-mode-hook
	    #'add-fira-code-symbol-keywords)
#+END_SRC

* Keybindings
** Use `smarter-move-beginning-of-line`
#+begin_src emacs-lisp  :results silent
  (global-set-key [remap move-beginning-of-line]
                  'smarter-move-beginning-of-line)
#+end_src
** Helper functions
#+begin_src emacs-lisp  :results silent
(defun skeleten/define-global-key (key desc command)
  "Bind a key to the global key map with an description"
  (global-set-key (kbd key) command)
  (which-key-add-key-based-replacements key desc))
(defun skeleten/define-global-prefix (pref desc)
  "Define a description for a global prefix"
  (which-key-add-prefix-title pref desc))

(defun skeleten/define-global-keys (list)
  "Define a list of Key description and commands to the global keymap."
  (if (consp list)
      (let ((key (car list))
	    (desc (car (cdr list)))
	    (command (car (cdr (cdr list))))
	    (rest (cdr (cdr (cdr list)))))
	(skeleten/define-global-key key desc command)
	(skeleten/define-global-keys rest))))
#+end_src
** Unbind some stuff to avoid collisions
#+begin_src emacs-lisp  :results silent
(global-unset-key (kbd "M-m"))
#+end_src
** Finding and searching stuff
#+begin_src emacs-lisp  :results silent
(skeleten/define-global-keys
 '("C-s"	"Search"			swiper
   "M-x"	"M-x"				counsel-M-x
   "C-x C-f"	"Find file"			counsel-find-file
   "C-h f"	"Describe function"		counsel-describe-function
   "C-h k"	"Describe key"			describe-key
   "C-x b"	"Switch buffer"			switch-to-buffer
   ))
#+end_src
** Multiple-Cursors
#+begin_src emacs-lisp  :results silent
(global-set-key (kbd "C-S-c C-S-c") 'mc/edit-lines)
(global-set-key (kbd "C-<") 'mc/mark-next-like-this)
(global-set-key (kbd "C->") 'mc/mark-previous-like-this)
(global-set-key (kbd "C-c C-<") 'mc/mark-all-like-this)
#+end_src
** Company
#+begin_src emacs-lisp  :results silent
(global-set-key [?\M-\t] 'company-complete)
(global-set-key [?\C-\t] 'company-complete)
#+end_src
** Magit
#+begin_src emacs-lisp  :results silent
  (global-set-key (kbd "C-x g") 'magit-status)
#+end_src
