emacs/.emacs.d/config.org
** Mail
#+begin_src emacs-lisp  :results silent
  (skeleten/define-global-prefix "M-m m" "Mail")
  (skeleten/define-global-keys
   '("M-m m o"    "Open Email interface"          mu4e
     "M-m m u"    "Update email and index"        mu4e-update-mail-and-index))
#+end_src
** Org
#+begin_src emacs-lisp  :results silent
  (skeleten/define-global-prefix "M-m o" "Org mode")
  (skeleten/define-global-keys
   '("M-m o a"    "Open Org Agenda"       org-agenda
     "M-m o e"	"Evaluate SRC-block"	org-babel-execute-src-block))
#+end_src

** TODO Sort / Misc
#+begin_src emacs-lisp  :results silent
  (global-set-key (kbd "M-n") 'er/expand-region)
  (skeleten/define-global-key "M-m c" "Compile" 'compile)
  (skeleten/define-global-keys
   '("M-m s"      "Jump to char on screen"        ace-jump-char-mode
     "C-."        "Toggle folding"                origami-toggle-node))
  (skeleten/define-global-key "M-m f f" "Find file in Project"
			      'fiplr-find-file)
  (skeleten/define-global-key "C-S-i" "Open iMenu"
			      'imenu)

  (skeleten/define-global-key "M-m f t" "Toggle Treemacs"
			      'treemacs)
#+end_src

** Modes
*** java-mode
#+BEGIN_SRC emacs-lisp :results silent
  (eval-after-load 'java
    '(define-key java-mode-map (kbd "C-s-i") 'lsp-ui-imenu))
#+END_SRC
*** lsp-ui-mode
#+BEGIN_SRC emacs-lisp :results silent
  (eval-after-load 'lsp-ui
    '(progn (define-key lsp-ui-mode-map
	      [remap xref-find-definitions]
	      #'lsp-ui-peek-find-definitions)
	    (define-key lsp-ui-mode-map
	      [remap xref-find-references]
	      #'lsp-ui-peek-find-references)
	    (define-key lsp-ui-mode-map
	      [remap imenu]
	      #'lsp-ui-imenu)))
#+END_SRC
* Coding
** Smartparens
#+begin_src emacs-lisp  :results silent
(require 'smartparens-config)
#+end_src
** Company
#+begin_src emacs-lisp  :results silent
(setq company-idle-delay 2)
(setq company-tooltip-align-annotations t)
(setq company-minimum-prefix-length 0)
#+end_src
** JDEE
#+BEGIN_SRC emacs-lisp :results silent
  (setq jdee-server-dir "~/.jars")
#+END_SRC
* Mail
** init stuff
#+begin_src emacs-lisp  :results silent
  (add-to-list 'load-path
	       "/usr/share/emacs/site-lisp/mu4e")
  (require 'org-mu4e)
  (require 'mu4e)
  (when (fboundp 'imagemagick-register-types)
    (imagemagick-register-types))

  (setq mu4e-update-interval 60)

  (mu4e-alert-set-default-style 'libnotify)
  (mu4e-alert-enable-mode-line-display)
  (add-hook 'after-init-hook #'mu4e-alert-enable-notifications)
#+end_src
** Accounts, etc
#+begin_src emacs-lisp  :results silent
  (setq mu4e-contexts
	`( ,(make-mu4e-context
	     :name "skeleten"
	     :match-func (lambda (msg)
			   (when msg
			     (string-prefix-p "/skeleten" (mu4e-message-field msg :maildir))))
	     :vars '((mu4e-trash-folder . "/skeleten/Trash")
		     (mu4e-refile-folder . "/skeleten/Archive")
		     (mu4e-sent-folder . "/skeleten/Sent")))
	   ,(make-mu4e-context
	     :name "VKM"
	     :match-func (lambda (msg)
			   (when msg
			     (string-prefix-p "/VKM" (mu4e-message-field msg :maildir))))
	     :vars '((mu4e-trash-folder . "/VKM/Deleted Items")
		     (mu4e-refile-folder . "/VKM/Archive")
		     (mu4e-sent-folder . "/VKM/Sent Items")))
	   ))
  ;; Bookmarks for mu4e; They go to searches
  ;; b <key> to jump to them
  (setq user-full-name "Jan Pelle Thomson"
	user-mail-address "me@skeleten.me")

  ;; (setq smtpmail-default-smtp-server "mail.skeleten.me"
  ;;       smtpmail-smtp-server "mail.skeleten.me"
  ;;       smtpmail-smtp-service 587
  ;;       smtpmail-smtp-user "me@skeleten.me"
  ;;       smtpmail-local-domain "skeleten.me")

  ;;  (setq mu4e-get-mail-command "offlineimap")

  (defvar my-mu4e-account-alist
    '(("skeleten"
       (mu4e-sent-folder "/skeleten/Sent")
       (user-mail-address "me@skeleten.me")
       (smtpmail-smtp-user "me@skeleten.me")
       (smtpmail-local-domain "skeleten.me")
       (smtpmail-default-smtp-server "mail.skeleten.me")
       (smtpmail-smtp-server "mail.skeleten.me")
       (smtpmail-smtp-service 587))
      ("VKM"
       (mu4e-sent-folder "/VKM/Sent Items")
       (user-mail-address "thomson@vkm.tu-darmstadt.de")
       (smtpmail-smtp-user "thomson")
       (smtpmail-local-domain "vkm.tu-darmstadt.de")
       (smtpmail-default-smtp-server "mail.vkm.tu-darmstadt.de")
       (smtpmail-smtp-server "mail.vkm.tu-darmstadt.de")
       (smtpmail-smtp-service 587))
      ))

  (defun my-mu4e-set-account ()
    "Set the account for composing a message.
       This function is taken from:
	 https://www.djcbsoftware.nl/code/mu/mu4e/Multiple-accounts.html"
    (let* ((account
	    (if mu4e-compose-parent-message
		(let ((maildir (mu4e-message-field mu4e-compose-parent-message :maildir)))
		  (string-match "/\\(.*?\\)/" maildir)
		  (match-string 1 maildir))
	      (mu4e-context-name (mu4e-context-current))))
	   (account-vars (cdr (assoc account my-mu4e-account-alist))))
      (if account-vars
	  (mapc #'(lambda (var)
		    (message "set " (car var) " to " (cadr var))
		    (set (car var) (cadr var)))
		account-vars)
	(error "No email account found"))))

  (add-hook 'mu4e-compose-pre-hook 'my-mu4e-set-account)
#+end_src
** Bookmarks
#+begin_src emacs-lisp  :results silent
  (setq mu4e-bookmarks
	`(,(make-mu4e-bookmark
	     :name "VKM"
	     :query "maildir:\"/VKM/INBOX*\" AND NOT flag:trashed"
	     :key ?v)
	  ,(make-mu4e-bookmark
	    :name "Privat"
	    :query "maildir:\"/skeleten/INBOX*\" AND NOT flag:trashed"
	    :key ?p)
	  ,(make-mu4e-bookmark
	     :name  "Unread messages"
	     :query "flag:unread AND NOT flag:trashed"
	     :key ?u)
	   ,(make-mu4e-bookmark
	     :name "Today's messages"
	     :query "date:today..now AND NOT flag:trashed"
	     :key ?t)
	   ,(make-mu4e-bookmark
	     :name "Last 7 days"
	     :query "date:7d..now AND NOT flag:trashed"
	     :key ?w)))
#+end_src
** Customization
*** Headers
#+begin_src emacs-lisp  :results silent
  (setq mu4e-headers-date-format "%Y-%m-%d"
	mu4e-use-fancy-chars nil
	mu4e-view-show-images t
	mu4e-headers-fields '((:human-date . 12)
			      (:flags . 6)
			      (:from . 22)
			      (:subject)))
  (defun skeleten/mu4e/unbold-fonts ()
    (interactive)
    (set-face-attribute 'mu4e-header-highlight-face nil
			:bold nil)
    (set-face-attribute 'mu4e-unread-face nil
			:bold nil)
    (set-face-attribute 'mu4e-flagged-face nil
			:bold nil)
    (set-face-attribute 'mu4e-context-face nil
			:bold nil))
  (add-hook 'mu4e-headers-mode-hook
	    'skeleten/mu4e/unbold-fonts)
#+end_src
*** Actions
#+BEGIN_SRC emacs-lisp :results silent
  (add-to-list 'mu4e-view-actions
               '("ViewInBrowser" . mu4e-action-view-in-browser) t)
#+END_SRC
* IRC
** Server
#+BEGIN_SRC emacs-lisp :results silent
  (setq rcirc-server-alist
	'(("irc.freenode.net" :port 6697 :encryption tls
	   :channels ("#archlinux-newbie"))
	  ("irc.mozilla.org" :port 6667
	   :channels ("#rust-beginners" "#rust"))
	  ("embyr.fyrechat.net" :port 6667
	   :channels ("#vana"))))
#+END_SRC
** Beep on mention
#+BEGIN_SRC emacs-lisp :results silent
  (setq skeleten/alert-sound
	"/usr/share/sounds/freedesktop/stereo/message-new-instant.oga")
  (defun skeleten/rcirc-print-hook (process sender response target text)
    (when (and (string-match (regexp-quote (rcirc-nick process)) text)
	       (not (string= (rcirc-nick process) sender))
	       (not (string= (rcirc-server-name process) sender)))
      (start-process "beep" nil "mpv" (expand-file-name skeleten/alert-sound))))
  (add-hook 'rcirc-print-functions
	    'skeleten/rcirc-print-hook)
#+END_SRC
* Dashboard
#+begin_src emacs-lisp  :results silent
  (require 'dashboard)
  (dashboard-setup-startup-hook)
#+end_src
* Package/Mode-Specific
** css-mode
#+begin_src emacs-lisp  :results silent
(add-hook 'css-mode-hook 'rainbow-mode)
#+end_src
** dired-mode
#+begin_src emacs-lisp  :results silent
(add-hook 'dired-mode-hook 'dired-hide-details-mode)
#+end_src
** emacs-lisp-mode
#+begin_src emacs-lisp  :results silent
(add-to-list 'auto-mode-alist
	     '("\\.el\\'" . emacs-lisp-mode))
(add-hook 'emacs-lisp-mode-hook 'paredit-mode)
#+end_src
** html-mode
#+begin_src emacs-lisp  :results silent
(add-hook 'html-mode-hook
	  'display-line-numbers-mode)
(add-hook 'html-mode-hook
	  'zencoding-mode)
(add-hook 'html-mode-hook
	  'smartparens-mode)
#+end_src
