emacs/.emacs.d/config.org
** latex-mode
#+begin_src emacs-lisp  :results silent
  (add-to-list 'load-path
		 "/usr/share/emacs/site-lisp")
  (load "auctex.el" nil t t)
  (load "preview-latex.el" nil t t)

  (add-hook 'latex-mode-hook 'display-line-numbers-mode)
  (add-hook 'latex-mode-hook 'company-mode)
  (add-hook 'latex-mode-hook 'smartparens-mode)
  (add-hook 'LaTeX-mode-hook 'display-line-numbers-mode)
  (add-hook 'LaTeX-mode-hook 'company-mode)
  (add-hook 'LaTeX-mode-hook 'smartparens-mode)

  (setq TeX-auto-save t)
  (setq TeX-parse-self t)
  (setq TeX-save-query nil)
  ; (setq TeX-PDF-mode t)
#+end_src
** markdown-mode
#+begin_src emacs-lisp  :results silent
(add-hook 'markdown-mode-hook 'display-line-numbers-mode)
#+end_src
** org-mode
#+begin_src emacs-lisp  :results silent
  (add-hook 'org-mode-hook
	    'smartparens-mode)
  (add-hook 'org-mode-hook
	    'display-line-numbers-mode)

  (defun skeleten/org/get-org-files ()
    (mapcar (lambda (f)
	      (concat
	       (file-name-as-directory skeleten/org-files-base-dir) f))
	    (directory-files skeleten/org-files-base-dir nil "\\.org$")))

  (setq org-default-notes-file "~/org/Main.org"
	org-agenda-files (skeleten/org/get-org-files)
	org-log-done 'time)
  (setq org-src-fontify-natively t
	org-return-follows-link t)

  (add-to-list 'org-latex-packages-alist
	       "\\usepackage{minted}")
  ;; TODO add to headers
  ;; \usemintedstyle{emacs}

  (setq org-latex-listings 'minted)
  (setq org-latex-custom-lang-environments
	'((emacs-lisp "common-lispcode")))
  (setq org-latex-minted-options
	'(("breaklines" "")))
  (setq org-latex-to-pdf-process
	'("pdflatex -shell-escape -interaction nonstopmode %f"
	  "pdflatex -shell-escape -interaction nonstopmode %f"
	  "pdflatex -shell-escape -interaction nonstopmode %f" ))
#+end_src
** org-babel
#+BEGIN_SRC emacs-lisp :results silent
  (setq skeleten/org-babel/safe-languages '("emacs-lisp"))

  (org-babel-do-load-languages 'org-babel-load-languages
			       '((shell . t)))
  (setq org-confirm-babel-evaluate
	(lambda (lang body) (not (member lang skeleten/org-babel/safe-languages))))
#+END_SRC

** prog-mode
#+begin_src emacs-lisp  :results silent
(add-hook 'prog-mode-hook 'company-mode)
(add-hook 'prog-mode-hook 'display-line-numbers-mode)
(add-hook 'prog-mode-hook 'prettify-symbols-mode)
(add-hook 'prog-mode-hook 'smartparens-mode)
(add-hook 'prog-mode-hook 'rainbow-delimiters-mode)
#+end_src
** restclient-mode
#+begin_src emacs-lisp  :results silent
(add-hook 'restclient-mode 'company-mode)
#+end_src
** eglot
#+BEGIN_SRC emacs-lisp :results silent
  (require 'eglot)
#+END_SRC
** rust-mode
#+begin_src emacs-lisp  :results silent
  (require 'lsp-rust)
  (autoload 'rust-mode "rust-mode" nil t)
  (add-to-list 'auto-mode-alist
       '("\\.rs\\'" . rust-mode))

  (add-hook 'rust-mode-hook #'flycheck-mode)
  (add-hook 'rust-mode-hook 'origami-mode)
  (add-hook 'rust-mode-hook 'cargo-minor-mode)
  (add-hook 'rust-mode-hook 'lsp-rust-enable)
  (add-hook 'flycheck-mode-hook #'flycheck-rust-setup)
#+end_src
** toml-mode
#+begin_src emacs-lisp  :results silent
(add-to-list 'auto-mode-alist
	     '("\\.toml\\'" . toml-mode))
(add-hook 'toml-mode-hook
	  'display-line-numbers-mode)
(add-hook 'toml-mode-hook
	  'smartparens-mode)

#+end_src
** yaml-mode
#+begin_src emacs-lisp  :results silent
(add-to-list 'auto-mode-alist
	     '("\\.yml\\'" . yaml-mode))
(add-hook 'yaml-mode-hook
	  'display-line-numbers-mode)
(add-hook 'yaml-mode-hook
	  'smartparens-mode)

#+end_src
** yasnippet
#+begin_src emacs-lisp :results silent
  (require 'yasnippet)
  (yas-global-mode)
#+end_src
** which-key
#+BEGIN_SRC emacs-lisp :results silent
  (which-key-mode)
#+END_SRC
** undo-tree
#+BEGIN_SRC emacs-lisp :results silent
  (require 'undo-tree)
  (global-undo-tree-mode)
#+END_SRC
** multiple-cursors
#+BEGIN_SRC emacs-lisp :results silent
  (require 'multiple-cursors)
#+END_SRC
** neotree
#+BEGIN_SRC emacs-lisp :results silent
  (setq neo-theme
        (if (display-graphic-p) 'icons 'arrow))
#+END_SRC
** slack
#+BEGIN_SRC emacs-lisp :results silent
  (use-package slack
    :commands (slack-start)
    :init
    (setq slack-buffer-emojify t)
    (setq slack-prefer-current-team t)
    :config
    (slack-register-team
     :name "Verbrennungskraftmaschinen und Fahrzeugantriebe"
     :client-id skeleten/slack/client-id
     :client-secret skeleten/slack/client-secret
     :token skeleten/slack/token
     :subscribed-channels '(allgemein it-interna)))
#+END_SRC
** ivy-mode
#+BEGIN_SRC emacs-lisp :results silent
  (ivy-mode 1)
#+END_SRC
** telephone-line
#+BEGIN_SRC emacs-lisp :results silent
  (setq telephone-line-lhs
	'((accent . (telephone-line-vc-segment
		     telephone-line-erc-modified-channels-segment
		     telephone-line-process-segment))
	  (nil	. (telephone-line-buffer-segment))))
  (setq telephone-line-rhs
	'((nil	. (telephone-line-misc-info-segment))
	  (accent . (telephone-line-major-mode-segment))
	  (evil	. (telephone-line-airline-position-segment))))
  (telephone-line-mode t)
#+END_SRC
** before-save
#+BEGIN_SRC emacs-lisp :results silent
  (add-hook 'before-save-hook
	    'delete-trailing-whitespace)
#+END_SRC
** promela-mode
#+BEGIN_SRC emacs-lisp :results silent
  (require 'promela-mode)
  (require 'ob-promela)
  (add-to-list 'auto-mode-alist
	       '("\\.pml\\'" . promela-mode))

#+END_SRC
** treemacs
#+BEGIN_SRC emacs-lisp :results silent
  (add-hook 'treemacs-mode-hook
	    'treemacs-follow-mode)
  (add-hook 'treemacs-mode-hook
	    (lambda () (treemacs-git-mode 'deferred)))

  ;; dont use graphical icons, pretty please
  (setq treemacs-no-png-images t)
#+END_SRC
** java-mode
#+BEGIN_SRC emacs-lisp :results silent
  ;; Either `eclipse' or `intellij'
  (setq skeleten/java-mode/backend	'eclipse)

  (require 'company-lsp)
  (if (boundp 'skeleten/java-mode/backend)
      (pcase skeleten/java-mode/backend
	('eclipse
	 (require 'lsp-java)
	 (add-hook 'java-mode-hook #'lsp-java-enable))
	('intellij
	 (require 'lsp-intellij)
	 (add-hook 'java-mode-hook #'lsp-intellij-enable)
	 (error "XXX: IntelliJ java backend unimplemented!"))
	(other (error "Unknown java backend")))
    (error "skeleten/java/backend undbound!"))

  (add-hook 'java-mode-hook 'company-mode)
  (add-hook 'java-mode-hook 'flycheck-mode)
#+END_SRC
** lsp-mode
#+BEGIN_SRC emacs-lisp :results silent
  (require 'lsp-ui)
  (add-hook 'lsp-mode-hook 'lsp-ui-mode)
#+END_SRC
** lsp-ui
#+BEGIN_SRC emacs-lisp :results silent
  (add-hook 'lsp-ui-mode-hook
	    (lambda () (lsp-ui-doc-mode 0)))
#+END_SRC
