emacs/.emacs.d/config.el
(load "auctex.el" nil t t)
(load "preview-latex.el" nil t t)

(add-hook 'latex-mode-hook 'display-line-numbers-mode)
(add-hook 'latex-mode-hook 'company-mode)
(add-hook 'latex-mode-hook 'smartparens-mode)
(add-hook 'LaTeX-mode-hook 'display-line-numbers-mode)
(add-hook 'LaTeX-mode-hook 'company-mode)
(add-hook 'LaTeX-mode-hook 'smartparens-mode)

(setq TeX-auto-save t)
(setq TeX-parse-self t)
(setq TeX-save-query nil)
; (setq TeX-PDF-mode t)

(add-hook 'markdown-mode-hook 'display-line-numbers-mode)

(add-hook 'org-mode-hook
	  'smartparens-mode)
(add-hook 'org-mode-hook
	  'display-line-numbers-mode)

(defun skeleten/org/get-org-files ()
  (mapcar (lambda (f)
	    (concat
	     (file-name-as-directory skeleten/org-files-base-dir) f))
	  (directory-files skeleten/org-files-base-dir nil "\\.org$")))

(setq org-default-notes-file "~/org/Main.org"
      org-agenda-files (skeleten/org/get-org-files)
      org-log-done 'time)
(setq org-src-fontify-natively t
      org-return-follows-link t)

(add-to-list 'org-latex-packages-alist
	     "\\usepackage{minted}")
;; TODO add to headers
;; \usemintedstyle{emacs}

(setq org-latex-listings 'minted)
(setq org-latex-custom-lang-environments
      '((emacs-lisp "common-lispcode")))
(setq org-latex-minted-options
      '(("breaklines" "")))
(setq org-latex-to-pdf-process
      '("pdflatex -shell-escape -interaction nonstopmode %f"
	"pdflatex -shell-escape -interaction nonstopmode %f"
	"pdflatex -shell-escape -interaction nonstopmode %f" ))

(setq skeleten/org-babel/safe-languages '("emacs-lisp"))

(org-babel-do-load-languages 'org-babel-load-languages
			     '((shell . t)))
(setq org-confirm-babel-evaluate
      (lambda (lang body) (not (member lang skeleten/org-babel/safe-languages))))

(add-hook 'prog-mode-hook 'company-mode)
(add-hook 'prog-mode-hook 'display-line-numbers-mode)
(add-hook 'prog-mode-hook 'prettify-symbols-mode)
(add-hook 'prog-mode-hook 'smartparens-mode)
(add-hook 'prog-mode-hook 'rainbow-delimiters-mode)

(add-hook 'restclient-mode 'company-mode)

(require 'eglot)

(require 'lsp-rust)
(autoload 'rust-mode "rust-mode" nil t)
(add-to-list 'auto-mode-alist
     '("\\.rs\\'" . rust-mode))

(add-hook 'rust-mode-hook #'flycheck-mode)
(add-hook 'rust-mode-hook 'origami-mode)
(add-hook 'rust-mode-hook 'cargo-minor-mode)
(add-hook 'rust-mode-hook 'lsp-rust-enable)
(add-hook 'flycheck-mode-hook #'flycheck-rust-setup)

(add-to-list 'auto-mode-alist
	     '("\\.toml\\'" . toml-mode))
(add-hook 'toml-mode-hook
	  'display-line-numbers-mode)
(add-hook 'toml-mode-hook
	  'smartparens-mode)

(add-to-list 'auto-mode-alist
	     '("\\.yml\\'" . yaml-mode))
(add-hook 'yaml-mode-hook
	  'display-line-numbers-mode)
(add-hook 'yaml-mode-hook
	  'smartparens-mode)

(require 'yasnippet)
(yas-global-mode)

(which-key-mode)

(require 'undo-tree)
(global-undo-tree-mode)

(require 'multiple-cursors)

(setq neo-theme
      (if (display-graphic-p) 'icons 'arrow))

(use-package slack
  :commands (slack-start)
  :init
  (setq slack-buffer-emojify t)
  (setq slack-prefer-current-team t)
  :config
  (slack-register-team
   :name "Verbrennungskraftmaschinen und Fahrzeugantriebe"
   :client-id skeleten/slack/client-id
   :client-secret skeleten/slack/client-secret
   :token skeleten/slack/token
   :subscribed-channels '(allgemein it-interna)))

(ivy-mode 1)

(setq telephone-line-lhs
      '((accent . (telephone-line-vc-segment
		   telephone-line-erc-modified-channels-segment
		   telephone-line-process-segment))
	(nil	. (telephone-line-buffer-segment))))
(setq telephone-line-rhs
      '((nil	. (telephone-line-misc-info-segment))
	(accent . (telephone-line-major-mode-segment))
	(evil	. (telephone-line-airline-position-segment))))
(telephone-line-mode t)

(add-hook 'before-save-hook
	  'delete-trailing-whitespace)

(require 'promela-mode)
(require 'ob-promela)
(add-to-list 'auto-mode-alist
	     '("\\.pml\\'" . promela-mode))

(add-hook 'treemacs-mode-hook
	  'treemacs-follow-mode)
(add-hook 'treemacs-mode-hook
	  (lambda () (treemacs-git-mode 'deferred)))

;; dont use graphical icons, pretty please
(setq treemacs-no-png-images t)

;; Either `eclipse' or `intellij'
(setq skeleten/java-mode/backend	'eclipse)

(require 'company-lsp)
(if (boundp 'skeleten/java-mode/backend)
    (pcase skeleten/java-mode/backend
      ('eclipse
       (require 'lsp-java)
       (add-hook 'java-mode-hook #'lsp-java-enable))
      ('intellij
       (require 'lsp-intellij)
       (add-hook 'java-mode-hook #'lsp-intellij-enable)
       (error "XXX: IntelliJ java backend unimplemented!"))
      (other (error "Unknown java backend")))
  (error "skeleten/java/backend undbound!"))

(add-hook 'java-mode-hook 'company-mode)
(add-hook 'java-mode-hook 'flycheck-mode)

(require 'lsp-ui)
(add-hook 'lsp-mode-hook 'lsp-ui-mode)

(add-hook 'lsp-ui-mode-hook
	  (lambda () (lsp-ui-doc-mode 0)))
